opba-protocols/xs2a-protocol/src/test/resources/mapper-test-fixtures/payment_initiation_xs2a_context_from_initiated_single_payment_request_output.json

{
  "paymentId": "cef0cbf3-6458-4f13-a418-ee4d7e750511",
  "requestId": "cef0cbf3-6458-4f13-a418-ee4d7e750511",
  "paymentType": "SINGLE",
  "tppBrandLoggingInformation": "Test Brand Logging Information",
  "tppNotificationURI": "http://localhost:5500/from-aspsp/v1/consent/c86feb1e-9ba8-4407-918f-8183143df295/fromAspsp/STUB_STATE/notify",
  "tppNotificationContentPreferred": "Testt Notification Content Preferred ",
  "tppDecoupledPreferred": true,
  "contentType": "application/json",
  "flowByAction": {
    "LIST_ACCOUNTS": "xs2a-list-accounts",
    "LIST_TRANSACTIONS": "xs2a-list-transactions",
    "SINGLE_PAYMENT": "xs2a-single-payments"
  },
  "psuIpAddress": "1.1.1.1",
  "startScaProcessResponse": null,
  "psuPassword": null,
  "fintechRedirectUriOk": "http://localhost:5500/from-aspsp/v1/consent/c86feb1e-9ba8-4407-918f-8183143df295/fromAspsp/STUB_STATE/ok?redirectCode=a5001521-edd8-4d99-b72d-30670b839d06",
  "fintechRedirectUriNok": "http://localhost:5500/from-aspsp/v1/consent/c86feb1e-9ba8-4407-918f-8183143df295/fromAspsp/STUB_STATE/nok?redirectCode=a5001521-edd8-4d99-b72d-30670b839d06",
  "redirectConsentOk": false,
  "mode": null,
  "aspspId": "53c47f54-b9a4-465a-8f77-bc6cd5f0cf46",
  "action": null,
  "sagaId": null,
  "serviceSessionId": null,
  "authorizationSessionIdIfOpened": null,
  "redirectCodeIfAuthContinued": null,
  "aspspRedirectCode": null,
  "violations": [],
  "lastRedirection": null,
  "online": null,
  "payment": {
    "endToEndIdentification": "Test endToEndIdentification",
    "creditorAgent": "Test creditorAgent ",
    "creditorName": "peter",
    "creditorAccount": {
      "iban": "AL90208110080000001039531801",
      "currency": "EUR"
    },
    "instructedAmount": {
      "currency": "EUR",
      "amount": "12.34"
    },
    "creditorAddress": {},
    "debtorAccount": {
      "iban": "DE80760700240271232400",
      "currency": "EUR"
    }
  }

}
